[
    {
        "id": 1,
        "name": "Action",
        "description": "Thể loại hành động, thường có nội dung về đánh nhau, bạo lực, hỗn loạn, với diễn biến nhanh."
    },
    {
        "id": 2,
        "name": "Adapted to Anime",
        "description": "Truyện đã được chuyển thể thành Anime."
    },
    {
        "id": 3,
        "name": "Adapted to Drama CD",
        "description": "Truyện đã được chuyển thể thành Drama CD."
    },
    {
        "id": 4,
        "name": "Adapted to Manga",
        "description": "Truyện đã được chuyển thể thành Manga."
    },
    { "id": 5, "name": "Adult", "description": "Nội dung nhạy cảm." },
    {
        "id": 6,
        "name": "Adventure",
        "description": "Thể loại phiêu lưu, mạo hiểm, thường là hành trình của các nhân vật."
    },
    {
        "id": 7,
        "name": "Age Gap",
        "description": "Trong truyện có thể hiện tình cảm giữa các nhân vật với cách biệt tuổi tác trên 5 năm hoặc hơn."
    },
    {
        "id": 8,
        "name": "Boys Love",
        "description": "Truyện có yếu tố đồng tính nam."
    },
    {
        "id": 9,
        "name": "Character Growth",
        "description": "Thể loại tập trung vào sự phát triển của nhân vật theo từng giai đoạn."
    },
    {
        "id": 10,
        "name": "Chinese Novel",
        "description": "Light Novel được viết bằng tiếng Trung Quốc, bao gồm các truyện có xuất xứ Đại Lục và Đài Loan"
    },
    {
        "id": 11,
        "name": "Comedy",
        "description": "Thể loại có các tình tiết gây cười, các xung đột nhẹ nhàng nhưng tạo được tiếng cười nơi độc giả."
    },
    {
        "id": 12,
        "name": "Cooking",
        "description": "Những truyện có nội dung liên quan đến việc nấu ăn"
    },
    {
        "id": 13,
        "name": "Different Social Status",
        "description": "Nội dung thiên về giải quyết sự khác biệt giữa các giai cấp, giai tầng xã hội."
    },
    {
        "id": 14,
        "name": "Drama",
        "description": "Thể loại kịch tính, mang đến cho người xem những cảm xúc khác nhau: buồn bã, căng thẳng thậm chí là bi phẫn."
    },
    {
        "id": 15,
        "name": "Ecchi",
        "description": "Thể loại có những tình huống nhạy cảm nhằm lôi cuốn người xem."
    },
    {
        "id": 16,
        "name": "English Novel",
        "description": "Các truyện được viết bằng tiếng Anh."
    },
    {
        "id": 17,
        "name": "Fanfiction",
        "description": "Thể loại truyện giả tưởng vay mượn nhân vật/bối cảnh của một hoặc nhiều truyện nguyên tác khác. Fanfiction trên Hako phải là những bộ chất lượng và nổi tiếng."
    },
    {
        "id": 18,
        "name": "Fantasy",
        "description": "Thể loại xuất phát từ trí tưởng tượng phong phú, từ pháp thuật đến thế giới trong mơ thậm chí là những câu chuyện thần tiên."
    },
    {
        "id": 19,
        "name": "Female Protagonist",
        "description": "Truyện có nhân vật chính là nữ."
    },
    {
        "id": 20,
        "name": "Game",
        "description": "Thể loại có nội dung xoay quanh các trò chơi hay lấy ý tưởng hoặc phỏng theo trò chơi."
    },
    {
        "id": 21,
        "name": "Gender Bender",
        "description": "Là một thể loại trong đó giới tính của nhân vật bị lẫn lộn: nam hoá thành nữ, nữ hóa thành nam..."
    },
    {
        "id": 22,
        "name": "Harem",
        "description": "Thể loại truyện tình cảm, lãng mạn mà trong đó, nhiều nhân vật thích một nhân vật chính"
    },
    {
        "id": 23,
        "name": "Historical",
        "description": "Thể loại truyện lấy cảm hứng từ các sự kiện lịch sử hoặc cốt truyện gắn liền với các sự kiện lịch sử với dòng thời gian đóng vai trò quan trọng."
    },
    {
        "id": 24,
        "name": "Horror",
        "description": "Thể loại rùng rợn, làm cho bạn kinh hãi, khiếp sợ, ghê tởm, run rẩy, có thể gây shock - một thể loại không dành cho người yếu tim."
    },
    {
        "id": 25,
        "name": "Incest",
        "description": "Truyện đề cập đến tình yêu giữa các thành viên trong gia đình"
    },
    {
        "id": 26,
        "name": "Isekai",
        "description": "Mang ý nghĩa \"thế giới khác\". Nhân vật chính thường sống lại (trọng sinh), chuyển sinh đến thế giới khác, hoặc bị triệu hồi."
    },
    {
        "id": 27,
        "name": "Josei",
        "description": "Thể loại sáng tác chủ yếu bởi phụ nữ cho độc giả nữ 18-30 tuổi, miêu tả lãng mạn thực tế, cốt truyện rõ ràng."
    },
    {
        "id": 28,
        "name": "Korean Novel",
        "description": "Light Novel theo phong cách Hàn Quốc"
    },
    {
        "id": 29,
        "name": "Magic",
        "description": "Truyện có các yếu tố liên quan đến ma thuật như phù phép, bùa chú."
    },
    {
        "id": 30,
        "name": "Martial Arts",
        "description": "Truyện có liên quan đến võ thuật, bao gồm cả các môn võ đối kháng thực tế lẫn hư cấu"
    },
    {
        "id": 31,
        "name": "Mature",
        "description": "Truyện có những yếu tố dành cho người trưởng thành (trên 18 tuổi)"
    },
    {
        "id": 32,
        "name": "Mecha",
        "description": "Thể loại nói tới những robot hoặc máy móc, thường là những cỗ máy biết đi do phi công cầm lái."
    },
    {
        "id": 33,
        "name": "Military",
        "description": "Thể loại liên quan đến quân sự, thường đi kèm với chiến tranh hoặc lịch sử."
    },
    {
        "id": 34,
        "name": "Misunderstanding",
        "description": "Nội dung xoay quanh sự hiểu nhầm giữa các nhân vật"
    },
    {
        "id": 35,
        "name": "Mystery",
        "description": "Thể loại bí ẩn, thường xuất hiện những điều bí ẩn không thể lí giải và những nỗ lực của nhân vật chính tìm câu trả lời."
    },
    {
        "id": 36,
        "name": "Netorare",
        "description": "Thể loại mà vợ hoặc người yêu của nhân vật chính bị người khác chiếm đoạt."
    },
    {
        "id": 37,
        "name": "One shot",
        "description": "Những truyện ngắn, kết thúc trong 1 chương hay 1 tập duy nhất."
    },
    {
        "id": 38,
        "name": "Otome Game",
        "description": "Nhân vật đầu thai vào thế giới game dành cho nữ (Otome Game)"
    },
    {
        "id": 39,
        "name": "Parody",
        "description": "Bắt chước/sao chép văn phong, nhân vật, hoặc viết nội dung mới dựa trên tác phẩm gốc khác."
    },
    {
        "id": 40,
        "name": "Psychological",
        "description": "Liên quan đến vấn đề tâm lý của nhân vật (tâm thần bất ổn, điên cuồng ...)"
    },
    {
        "id": 41,
        "name": "Reverse Harem",
        "description": "Tương tự Harem nhưng nhân vật chính là nữ"
    },
    {
        "id": 42,
        "name": "Romance",
        "description": "Thể loại đề cập đến chuyện tình cảm lãng mạn, thường là tình yêu giữa hai phái."
    },
    {
        "id": 43,
        "name": "School Life",
        "description": "Thể loại học đường, ngữ cảnh diễn biến câu chuyện chủ yếu ở trường học."
    },
    {
        "id": 44,
        "name": "Science Fiction",
        "description": "Khoa học viễn tưởng, xoay quanh các hiện tượng liên quan tới khoa học, công nghệ, tưởng tượng con người."
    },
    {
        "id": 45,
        "name": "Seinen",
        "description": "Dành cho thanh niên 18-30 tuổi nhưng phù hợp cho cả độ tuổi lớn hơn. Có thể có bạo lực và khiêu dâm."
    },
    {
        "id": 46,
        "name": "Shoujo",
        "description": "Hướng tới phái nữ, nội dung thường liên quan đến tình cảm lãng mạn."
    },
    {
        "id": 47,
        "name": "Shoujo ai",
        "description": "Thể loại quan hệ hoặc liên quan tới đồng tính nữ, trên mức bình thường giữa các nhân vật nữ."
    },
    {
        "id": 48,
        "name": "Shounen",
        "description": "Hướng tới độc giả nam thanh niên."
    },
    {
        "id": 49,
        "name": "Shounen ai",
        "description": "Nội dung tình yêu giữa các chàng trai trẻ, ít đề cập quan hệ tình dục."
    },
    {
        "id": 50,
        "name": "Slice of Life",
        "description": "Thể loại nói về cuộc sống đời thường."
    },
    {
        "id": 51,
        "name": "Slow Life",
        "description": "Nhân vật tận hưởng cuộc sống nhàn nhã, ít yếu tố gay cấn."
    },
    {
        "id": 52,
        "name": "Sports",
        "description": "Các môn thể thao như bóng đá, bóng chày, bóng chuyền, đua xe, cầu lông,... là phần của thể loại này."
    },
    {
        "id": 53,
        "name": "Super Power",
        "description": "Các nhân vật sở hữu siêu năng lực hay kỹ năng siêu phàm."
    },
    {
        "id": 54,
        "name": "Supernatural",
        "description": "Xuất hiện sức mạnh đáng kinh ngạc và không thể giải thích, đi kèm sự kiện trái ngược định luật vật lý."
    },
    {
        "id": 55,
        "name": "Suspense",
        "description": "Tình tiết, diễn biến kịch tính tạo sự hồi hộp cho độc giả."
    },
    {
        "id": 56,
        "name": "Tragedy",
        "description": "Thể loại bi kịch, sự kiện dẫn đến kết cục mất mát hay rủi ro lớn."
    },
    {
        "id": 57,
        "name": "Wars",
        "description": "Truyện mô tả chi tiết về chiến tranh, chiến trận."
    },
    {
        "id": 58,
        "name": "Web Novel",
        "description": "Truyện viết trên blog cá nhân, không chính thức xuất bản."
    },
    {
        "id": 59,
        "name": "Workplace",
        "description": "Truyện mô tả chi tiết công việc và vấn đề trong công sở."
    },
    {
        "id": 60,
        "name": "Yuri",
        "description": "Thể loại về đồng tính nữ, có thể có cảnh sex."
    }
]
